zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/icm.h
/**
 * \brief Component description for PIC32CZ/CA70 ICM
 *
 * Copyright (c) 2017 Microchip Technology Inc.
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 */

/* file generated from device description version 2017-07-14T18:00:00Z */
#ifndef _PIC32CZ_CA70_ICM_COMPONENT_H_
#define _PIC32CZ_CA70_ICM_COMPONENT_H_

/** \addtogroup PIC32CZ_CA70_ICM Integrity Check Monitor
 *  @{
 */
/* ========================================================================== */
/**  SOFTWARE API DEFINITION FOR ICM */
/* ========================================================================== */

/* -------- ICM_CFG : (ICM Offset: 0x00) (R/W 32) Configuration Register -------- */

typedef union
{
  struct
  {
    uint32_t WBDIS:1;                   /**< bit:      0  Write Back Disable                            */
    uint32_t EOMDIS:1;                  /**< bit:      1  End of Monitoring Disable                     */
    uint32_t SLBDIS:1;                  /**< bit:      2  Secondary List Branching Disable              */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t BBC:4;                     /**< bit:   4..7  Bus Burden Control                            */
    uint32_t ASCD:1;                    /**< bit:      8  Automatic Switch To Compare Digest            */
    uint32_t DUALBUFF:1;                /**< bit:      9  Dual Input Buffer                             */
    uint32_t :2;                        /**< bit: 10..11  Reserved                                      */
    uint32_t UIHASH:1;                  /**< bit:     12  User Initial Hash Value                       */
    uint32_t UALGO:3;                   /**< bit: 13..15  User SHA Algorithm                            */
    uint32_t HAPROT:6;                  /**< bit: 16..21  Region Hash Area Protection                   */
    uint32_t :2;                        /**< bit: 22..23  Reserved                                      */
    uint32_t DAPROT:6;                  /**< bit: 24..29  Region Descriptor Area Protection             */
    uint32_t :2;                        /**< bit: 30..31  Reserved                                      */
  };
  uint32_t w;
} __ICM_CFG_bits_t;

#define ICM_CFG_WBDIS_Pos                     (0)                                            /**< (ICM_CFG) Write Back Disable Position */
#define ICM_CFG_WBDIS_Msk                     (0x1U << ICM_CFG_WBDIS_Pos)                    /**< (ICM_CFG) Write Back Disable Mask */
#define ICM_CFG_EOMDIS_Pos                    (1)                                            /**< (ICM_CFG) End of Monitoring Disable Position */
#define ICM_CFG_EOMDIS_Msk                    (0x1U << ICM_CFG_EOMDIS_Pos)                   /**< (ICM_CFG) End of Monitoring Disable Mask */
#define ICM_CFG_SLBDIS_Pos                    (2)                                            /**< (ICM_CFG) Secondary List Branching Disable Position */
#define ICM_CFG_SLBDIS_Msk                    (0x1U << ICM_CFG_SLBDIS_Pos)                   /**< (ICM_CFG) Secondary List Branching Disable Mask */
#define ICM_CFG_BBC_Pos                       (4)                                            /**< (ICM_CFG) Bus Burden Control Position */
#define ICM_CFG_BBC_Msk                       (0xFU << ICM_CFG_BBC_Pos)                      /**< (ICM_CFG) Bus Burden Control Mask */
#define ICM_CFG_BBC(value)                    (ICM_CFG_BBC_Msk & ((value) << ICM_CFG_BBC_Pos))
#define ICM_CFG_ASCD_Pos                      (8)                                            /**< (ICM_CFG) Automatic Switch To Compare Digest Position */
#define ICM_CFG_ASCD_Msk                      (0x1U << ICM_CFG_ASCD_Pos)                     /**< (ICM_CFG) Automatic Switch To Compare Digest Mask */
#define ICM_CFG_DUALBUFF_Pos                  (9)                                            /**< (ICM_CFG) Dual Input Buffer Position */
#define ICM_CFG_DUALBUFF_Msk                  (0x1U << ICM_CFG_DUALBUFF_Pos)                 /**< (ICM_CFG) Dual Input Buffer Mask */
#define ICM_CFG_UIHASH_Pos                    (12)                                           /**< (ICM_CFG) User Initial Hash Value Position */
#define ICM_CFG_UIHASH_Msk                    (0x1U << ICM_CFG_UIHASH_Pos)                   /**< (ICM_CFG) User Initial Hash Value Mask */
#define ICM_CFG_UALGO_Pos                     (13)                                           /**< (ICM_CFG) User SHA Algorithm Position */
#define ICM_CFG_UALGO_Msk                     (0x7U << ICM_CFG_UALGO_Pos)                    /**< (ICM_CFG) User SHA Algorithm Mask */
#define ICM_CFG_UALGO(value)                  (ICM_CFG_UALGO_Msk & ((value) << ICM_CFG_UALGO_Pos))
#define   ICM_CFG_UALGO_SHA1_Val              (0x0U)                                         /**< (ICM_CFG) SHA1 algorithm processed  */
#define   ICM_CFG_UALGO_SHA256_Val            (0x1U)                                         /**< (ICM_CFG) SHA256 algorithm processed  */
#define   ICM_CFG_UALGO_SHA224_Val            (0x4U)                                         /**< (ICM_CFG) SHA224 algorithm processed  */
#define ICM_CFG_UALGO_SHA1                    (ICM_CFG_UALGO_SHA1_Val << ICM_CFG_UALGO_Pos)  /**< (ICM_CFG) SHA1 algorithm processed Position  */
#define ICM_CFG_UALGO_SHA256                  (ICM_CFG_UALGO_SHA256_Val << ICM_CFG_UALGO_Pos)  /**< (ICM_CFG) SHA256 algorithm processed Position  */
#define ICM_CFG_UALGO_SHA224                  (ICM_CFG_UALGO_SHA224_Val << ICM_CFG_UALGO_Pos)  /**< (ICM_CFG) SHA224 algorithm processed Position  */
#define ICM_CFG_HAPROT_Pos                    (16)                                           /**< (ICM_CFG) Region Hash Area Protection Position */
#define ICM_CFG_HAPROT_Msk                    (0x3FU << ICM_CFG_HAPROT_Pos)                  /**< (ICM_CFG) Region Hash Area Protection Mask */
#define ICM_CFG_HAPROT(value)                 (ICM_CFG_HAPROT_Msk & ((value) << ICM_CFG_HAPROT_Pos))
#define ICM_CFG_DAPROT_Pos                    (24)                                           /**< (ICM_CFG) Region Descriptor Area Protection Position */
#define ICM_CFG_DAPROT_Msk                    (0x3FU << ICM_CFG_DAPROT_Pos)                  /**< (ICM_CFG) Region Descriptor Area Protection Mask */
#define ICM_CFG_DAPROT(value)                 (ICM_CFG_DAPROT_Msk & ((value) << ICM_CFG_DAPROT_Pos))
#define ICM_CFG_Msk                           (0x3F3FF3F7UL)                                 /**< (ICM_CFG) Register Mask  */

/* -------- ICM_CTRL : (ICM Offset: 0x04) (/W 32) Control Register -------- */

typedef union
{
  struct
  {
    uint32_t ENABLE:1;                  /**< bit:      0  ICM Enable                                    */
    uint32_t DISABLE:1;                 /**< bit:      1  ICM Disable Register                          */
    uint32_t SWRST:1;                   /**< bit:      2  Software Reset                                */
    uint32_t :1;                        /**< bit:      3  Reserved                                      */
    uint32_t REHASH:4;                  /**< bit:   4..7  Recompute Internal Hash                       */
    uint32_t RMDIS:4;                   /**< bit:  8..11  Region Monitoring Disable                     */
    uint32_t RMEN:4;                    /**< bit: 12..15  Region Monitoring Enable                      */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __ICM_CTRL_bits_t;

#define ICM_CTRL_ENABLE_Pos                   (0)                                            /**< (ICM_CTRL) ICM Enable Position */
#define ICM_CTRL_ENABLE_Msk                   (0x1U << ICM_CTRL_ENABLE_Pos)                  /**< (ICM_CTRL) ICM Enable Mask */
#define ICM_CTRL_DISABLE_Pos                  (1)                                            /**< (ICM_CTRL) ICM Disable Register Position */
#define ICM_CTRL_DISABLE_Msk                  (0x1U << ICM_CTRL_DISABLE_Pos)                 /**< (ICM_CTRL) ICM Disable Register Mask */
#define ICM_CTRL_SWRST_Pos                    (2)                                            /**< (ICM_CTRL) Software Reset Position */
#define ICM_CTRL_SWRST_Msk                    (0x1U << ICM_CTRL_SWRST_Pos)                   /**< (ICM_CTRL) Software Reset Mask */
#define ICM_CTRL_REHASH_Pos                   (4)                                            /**< (ICM_CTRL) Recompute Internal Hash Position */
#define ICM_CTRL_REHASH_Msk                   (0xFU << ICM_CTRL_REHASH_Pos)                  /**< (ICM_CTRL) Recompute Internal Hash Mask */
#define ICM_CTRL_REHASH(value)                (ICM_CTRL_REHASH_Msk & ((value) << ICM_CTRL_REHASH_Pos))
#define ICM_CTRL_RMDIS_Pos                    (8)                                            /**< (ICM_CTRL) Region Monitoring Disable Position */
#define ICM_CTRL_RMDIS_Msk                    (0xFU << ICM_CTRL_RMDIS_Pos)                   /**< (ICM_CTRL) Region Monitoring Disable Mask */
#define ICM_CTRL_RMDIS(value)                 (ICM_CTRL_RMDIS_Msk & ((value) << ICM_CTRL_RMDIS_Pos))
#define ICM_CTRL_RMEN_Pos                     (12)                                           /**< (ICM_CTRL) Region Monitoring Enable Position */
#define ICM_CTRL_RMEN_Msk                     (0xFU << ICM_CTRL_RMEN_Pos)                    /**< (ICM_CTRL) Region Monitoring Enable Mask */
#define ICM_CTRL_RMEN(value)                  (ICM_CTRL_RMEN_Msk & ((value) << ICM_CTRL_RMEN_Pos))
#define ICM_CTRL_Msk                          (0x0000FFF7UL)                                 /**< (ICM_CTRL) Register Mask  */

/* -------- ICM_SR : (ICM Offset: 0x08) (R/ 32) Status Register -------- */

typedef union
{
  struct
  {
    uint32_t ENABLE:1;                  /**< bit:      0  ICM Controller Enable Register                */
    uint32_t :7;                        /**< bit:   1..7  Reserved                                      */
    uint32_t RAWRMDIS:4;                /**< bit:  8..11  Region Monitoring Disabled Raw Status         */
    uint32_t RMDIS:4;                   /**< bit: 12..15  Region Monitoring Disabled Status             */
    uint32_t :16;                       /**< bit: 16..31  Reserved                                      */
  };
  uint32_t w;
} __ICM_SR_bits_t;

#define ICM_SR_ENABLE_Pos                     (0)                                            /**< (ICM_SR) ICM Controller Enable Register Position */
#define ICM_SR_ENABLE_Msk                     (0x1U << ICM_SR_ENABLE_Pos)                    /**< (ICM_SR) ICM Controller Enable Register Mask */
#define ICM_SR_RAWRMDIS_Pos                   (8)                                            /**< (ICM_SR) Region Monitoring Disabled Raw Status Position */
#define ICM_SR_RAWRMDIS_Msk                   (0xFU << ICM_SR_RAWRMDIS_Pos)                  /**< (ICM_SR) Region Monitoring Disabled Raw Status Mask */
#define ICM_SR_RAWRMDIS(value)                (ICM_SR_RAWRMDIS_Msk & ((value) << ICM_SR_RAWRMDIS_Pos))
#define ICM_SR_RMDIS_Pos                      (12)                                           /**< (ICM_SR) Region Monitoring Disabled Status Position */
#define ICM_SR_RMDIS_Msk                      (0xFU << ICM_SR_RMDIS_Pos)                     /**< (ICM_SR) Region Monitoring Disabled Status Mask */
#define ICM_SR_RMDIS(value)                   (ICM_SR_RMDIS_Msk & ((value) << ICM_SR_RMDIS_Pos))
#define ICM_SR_Msk                            (0x0000FF01UL)                                 /**< (ICM_SR) Register Mask  */

/* -------- ICM_IER : (ICM Offset: 0x10) (/W 32) Interrupt Enable Register -------- */

typedef union
{
  struct
  {
    uint32_t RHC:4;                     /**< bit:   0..3  Region Hash Completed Interrupt Enable        */
    uint32_t RDM:4;                     /**< bit:   4..7  Region Digest Mismatch Interrupt Enable       */
    uint32_t RBE:4;                     /**< bit:  8..11  Region Bus Error Interrupt Enable             */
    uint32_t RWC:4;                     /**< bit: 12..15  Region Wrap Condition detected Interrupt Enable */
    uint32_t REC:4;                     /**< bit: 16..19  Region End bit Condition Detected Interrupt Enable */
    uint32_t RSU:4;                     /**< bit: 20..23  Region Status Updated Interrupt Disable       */
    uint32_t URAD:1;                    /**< bit:     24  Undefined Register Access Detection Interrupt Enable */
    uint32_t :7;                        /**< bit: 25..31  Reserved                                      */
  };
  uint32_t w;
} __ICM_IER_bits_t;

#define ICM_IER_RHC_Pos                       (0)                                            /**< (ICM_IER) Region Hash Completed Interrupt Enable Position */
#define ICM_IER_RHC_Msk                       (0xFU << ICM_IER_RHC_Pos)                      /**< (ICM_IER) Region Hash Completed Interrupt Enable Mask */
#define ICM_IER_RHC(value)                    (ICM_IER_RHC_Msk & ((value) << ICM_IER_RHC_Pos))
#define ICM_IER_RDM_Pos                       (4)                                            /**< (ICM_IER) Region Digest Mismatch Interrupt Enable Position */
#define ICM_IER_RDM_Msk                       (0xFU << ICM_IER_RDM_Pos)                      /**< (ICM_IER) Region Digest Mismatch Interrupt Enable Mask */
#define ICM_IER_RDM(value)                    (ICM_IER_RDM_Msk & ((value) << ICM_IER_RDM_Pos))
#define ICM_IER_RBE_Pos                       (8)                                            /**< (ICM_IER) Region Bus Error Interrupt Enable Position */
#define ICM_IER_RBE_Msk                       (0xFU << ICM_IER_RBE_Pos)                      /**< (ICM_IER) Region Bus Error Interrupt Enable Mask */
#define ICM_IER_RBE(value)                    (ICM_IER_RBE_Msk & ((value) << ICM_IER_RBE_Pos))
#define ICM_IER_RWC_Pos                       (12)                                           /**< (ICM_IER) Region Wrap Condition detected Interrupt Enable Position */
#define ICM_IER_RWC_Msk                       (0xFU << ICM_IER_RWC_Pos)                      /**< (ICM_IER) Region Wrap Condition detected Interrupt Enable Mask */
#define ICM_IER_RWC(value)                    (ICM_IER_RWC_Msk & ((value) << ICM_IER_RWC_Pos))
#define ICM_IER_REC_Pos                       (16)                                           /**< (ICM_IER) Region End bit Condition Detected Interrupt Enable Position */
#define ICM_IER_REC_Msk                       (0xFU << ICM_IER_REC_Pos)                      /**< (ICM_IER) Region End bit Condition Detected Interrupt Enable Mask */
#define ICM_IER_REC(value)                    (ICM_IER_REC_Msk & ((value) << ICM_IER_REC_Pos))
#define ICM_IER_RSU_Pos                       (20)                                           /**< (ICM_IER) Region Status Updated Interrupt Disable Position */
#define ICM_IER_RSU_Msk                       (0xFU << ICM_IER_RSU_Pos)                      /**< (ICM_IER) Region Status Updated Interrupt Disable Mask */
#define ICM_IER_RSU(value)                    (ICM_IER_RSU_Msk & ((value) << ICM_IER_RSU_Pos))
#define ICM_IER_URAD_Pos                      (24)                                           /**< (ICM_IER) Undefined Register Access Detection Interrupt Enable Position */
#define ICM_IER_URAD_Msk                      (0x1U << ICM_IER_URAD_Pos)                     /**< (ICM_IER) Undefined Register Access Detection Interrupt Enable Mask */
#define ICM_IER_Msk                           (0x01FFFFFFUL)                                 /**< (ICM_IER) Register Mask  */

