zeha/xc32/pic32m-source/gcc/gcc/testsuite/gcc.target/pic32c/xc32-shell/test-dfp-32CZ_CA70/include/component/icm.h
#define ICM_HASH_HASA_Pos                     (7)                                            /**< (ICM_HASH) Hash Area Start Address Position */
#define ICM_HASH_HASA_Msk                     (0x1FFFFFFU << ICM_HASH_HASA_Pos)              /**< (ICM_HASH) Hash Area Start Address Mask */
#define ICM_HASH_HASA(value)                  (ICM_HASH_HASA_Msk & ((value) << ICM_HASH_HASA_Pos))
#define ICM_HASH_Msk                          (0xFFFFFF80UL)                                 /**< (ICM_HASH) Register Mask  */

/* -------- ICM_UIHVAL : (ICM Offset: 0x38) (/W 32) User Initial Hash Value 0 Register 0 -------- */

typedef union
{
  struct
  {
    uint32_t VAL:32;                    /**< bit:  0..31  Initial Hash Value                            */
  };
  uint32_t w;
} __ICM_UIHVAL_bits_t;

#define ICM_UIHVAL_VAL_Pos                    (0)                                            /**< (ICM_UIHVAL) Initial Hash Value Position */
#define ICM_UIHVAL_VAL_Msk                    (0xFFFFFFFFU << ICM_UIHVAL_VAL_Pos)            /**< (ICM_UIHVAL) Initial Hash Value Mask */
#define ICM_UIHVAL_VAL(value)                 (ICM_UIHVAL_VAL_Msk & ((value) << ICM_UIHVAL_VAL_Pos))
#define ICM_UIHVAL_Msk                        (0xFFFFFFFFUL)                                 /**< (ICM_UIHVAL) Register Mask  */

/** \brief ICM register offsets definitions */
#define ICM_CFG_OFFSET               (0x00)         /**< (ICM_CFG) Configuration Register Offset */
#define ICM_CTRL_OFFSET              (0x04)         /**< (ICM_CTRL) Control Register Offset */
#define ICM_SR_OFFSET                (0x08)         /**< (ICM_SR) Status Register Offset */
#define ICM_IER_OFFSET               (0x10)         /**< (ICM_IER) Interrupt Enable Register Offset */
#define ICM_IDR_OFFSET               (0x14)         /**< (ICM_IDR) Interrupt Disable Register Offset */
#define ICM_IMR_OFFSET               (0x18)         /**< (ICM_IMR) Interrupt Mask Register Offset */
#define ICM_ISR_OFFSET               (0x1C)         /**< (ICM_ISR) Interrupt Status Register Offset */
#define ICM_UASR_OFFSET              (0x20)         /**< (ICM_UASR) Undefined Access Status Register Offset */
#define ICM_DSCR_OFFSET              (0x30)         /**< (ICM_DSCR) Region Descriptor Area Start Address Register Offset */
#define ICM_HASH_OFFSET              (0x34)         /**< (ICM_HASH) Region Hash Area Start Address Register Offset */
#define ICM_UIHVAL_OFFSET            (0x38)         /**< (ICM_UIHVAL) User Initial Hash Value 0 Register 0 Offset */

/** \brief ICM register API structure */
typedef struct
{
  __IO  __ICM_CFG_bits_t               ICM_CFG;       /**< Offset: 0x00 (R/W  32) Configuration Register */
  __O   __ICM_CTRL_bits_t              ICM_CTRL;      /**< Offset: 0x04 ( /W  32) Control Register */
  __I   __ICM_SR_bits_t                ICM_SR;        /**< Offset: 0x08 (R/   32) Status Register */
  __I   uint8_t                        Reserved1[0x04];
  __O   __ICM_IER_bits_t               ICM_IER;       /**< Offset: 0x10 ( /W  32) Interrupt Enable Register */
  __O   __ICM_IDR_bits_t               ICM_IDR;       /**< Offset: 0x14 ( /W  32) Interrupt Disable Register */
  __I   __ICM_IMR_bits_t               ICM_IMR;       /**< Offset: 0x18 (R/   32) Interrupt Mask Register */
  __I   __ICM_ISR_bits_t               ICM_ISR;       /**< Offset: 0x1C (R/   32) Interrupt Status Register */
  __I   __ICM_UASR_bits_t              ICM_UASR;      /**< Offset: 0x20 (R/   32) Undefined Access Status Register */
  __I   uint8_t                        Reserved2[0x0C];
  __IO  __ICM_DSCR_bits_t              ICM_DSCR;      /**< Offset: 0x30 (R/W  32) Region Descriptor Area Start Address Register */
  __IO  __ICM_HASH_bits_t              ICM_HASH;      /**< Offset: 0x34 (R/W  32) Region Hash Area Start Address Register */
  __O   __ICM_UIHVAL_bits_t            ICM_UIHVAL[8]; /**< Offset: 0x38 ( /W  32) User Initial Hash Value 0 Register 0 */
} icm_registers_t;
/** @}  end of Integrity Check Monitor */

#endif /* _PIC32CZ_CA70_ICM_COMPONENT_H_ */
